cmsis-svd/cmsis-svd/data/HDSC/HC32M140KX.svd
<?xml version="1.0" ?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>HDSC Co.Ltd</vendor>
    <vendorID>HDSC</vendorID>
    <name>HDSC_HC32M140KX</name>
    <series>ARMCM0P</series>
    <version>1.2</version>
    <cpu>
        <name>CM0</name>
        <revision>r0p0</revision>
        <endian>little</endian>
        <mpuPresent>false</mpuPresent>
        <fpuPresent>false</fpuPresent>
        <nvicPrioBits>3</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <resetValue>0x0</resetValue>
    <resetMask>0x0</resetMask>
    <peripherals>
        <peripheral>
            <name>ADC</name>
            <description>desc ADC</description>
            <baseAddress>0x40027000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x58</size>
            </addressBlock>
            <registers>
                <register>
                    <name>ADCTL</name>
                    <description>desc ADCTL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE7</resetMask>
                    <fields>
                        <field>
                            <name>SCF</name>
                            <description>desc SCF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCF</name>
                            <description>desc PCF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCP</name>
                            <description>desc PCP</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>REFS</name>
                            <description>desc REFS</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALGN</name>
                            <description>desc ALGN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SP</name>
                            <description>desc SP</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCINT</name>
                    <description>desc ADCINT</description>
                    <addressOffset>0x2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x11BF</resetMask>
                    <fields>
                        <field>
                            <name>ADINT0E</name>
                            <description>desc ADINT0E</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADINT1E</name>
                            <description>desc ADINT1E</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADINT2E</name>
                            <description>desc ADINT2E</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADINT3E</name>
                            <description>desc ADINT3E</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADINT0F</name>
                            <description>desc ADINT0F</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADINT1F</name>
                            <description>desc ADINT1F</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADINT3F</name>
                            <description>desc ADINT3F</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADINT4E</name>
                            <description>desc ADINT4E</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADINT4F</name>
                            <description>desc ADINT4F</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCSCTL</name>
                    <description>desc ADCSCTL</description>
                    <addressOffset>0x8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SCST</name>
                            <description>desc SCST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCTMEN</name>
                            <description>desc SCTMEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPT</name>
                            <description>desc RPT</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMOD</name>
                            <description>desc SMOD</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCCLR</name>
                            <description>desc SCCLR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOV</name>
                            <description>desc SOV</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCFUL</name>
                            <description>desc SCFUL</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCEMP</name>
                            <description>desc SCEMP</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFS</name>
                    <description>desc SFS</description>
                    <addressOffset>0x9</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>SDPTH</name>
                            <description>desc SDPTH</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFD</name>
                    <description>desc SFD</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1000</resetValue>
                    <resetMask>0xFFF0131F</resetMask>
                    <fields>
                        <field>
                            <name>SCH</name>
                            <description>desc SCH</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STRGM</name>
                            <description>desc STRGM</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SVLD</name>
                            <description>desc SVLD</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SFD</name>
                            <description>desc SFD</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADSIN0</name>
                    <description>desc ADSIN0</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHSL0</name>
                            <description>desc CHSL0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL1</name>
                            <description>desc CHSL1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL2</name>
                            <description>desc CHSL2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL3</name>
                            <description>desc CHSL3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL4</name>
                            <description>desc CHSL4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL5</name>
                            <description>desc CHSL5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL6</name>
                            <description>desc CHSL6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL7</name>
                            <description>desc CHSL7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL8</name>
                            <description>desc CHSL8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL9</name>
                            <description>desc CHSL9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL10</name>
                            <description>desc CHSL10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL11</name>
                            <description>desc CHSL11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL12</name>
                            <description>desc CHSL12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL13</name>
                            <description>desc CHSL13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL14</name>
                            <description>desc CHSL14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHSL15</name>
                            <description>desc CHSL15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADSIN1</name>
                    <description>desc ADSIN1</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SCHSL0</name>
                            <description>desc SCHSL0</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCHSL1</name>
                            <description>desc SCHSL1</description>
                            <msb>9</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCHSL2</name>
                            <description>desc SCHSL2</description>
                            <msb>14</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCHSL3</name>
                            <description>desc SCHSL3</description>
                            <msb>19</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCHSL4</name>
                            <description>desc SCHSL4</description>
                            <msb>24</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCHSL5</name>
                            <description>desc SCHSL5</description>
                            <msb>29</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCPCTL</name>
                    <description>desc ADCPCTL</description>
                    <addressOffset>0x18</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>PCST</name>
                            <description>desc PCST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCTMEN</name>
                            <description>desc PCTMEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTEN</name>
                            <description>desc EXTEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCCLR</name>
                            <description>desc PCCLR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POV</name>
                            <description>desc POV</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCFUL</name>
                            <description>desc PCFUL</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCEMP</name>
                            <description>desc PCEMP</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
